// •	Първата и третата цифра трябва да бъдат четни
// •	Втората цифра трябва да бъде просто число в диапазона [2...7]

// •	Горната граница на първото число - цяло число в диапазона [1...9]
// •	Горната граница на второто число - цяло число в диапазона [1...9]
// •	Горната граница на третото число - цяло число в диапазона [1...9]

function six (input){

let ceilOne=Number(input[0]);
let ceilTwo=Number(input[1]);
let ceilThree=Number (input[2]);

for (let a=1; a<=ceilOne; a++){

    for (let b=1; b<=ceilTwo; b++){

        for (let c=1; c<=ceilThree; c++){
            if(a%2===0 && c%2===0 && (b===2 || b===3 || b===5 || b===7)){
                console.log(`${a} ${b} ${c}`);
            }

        }


    }

}


}
six (["3",
"5",
"5"])
